[
    {
        "title": "NASA to Broadcast Mars 2020 Perseverance Launch, Prelaunch Activities",
        "preview": "Starting July 27, news activities will cover everything from mission engineering and science to returning samples from Mars to, of course, the launch itself."
    },
    {
        "title": "Sensors on Mars 2020 Spacecraft Answer Long-Distance Call From Earth",
        "preview": "Instruments tailored to collect data during the descent of NASA's next rover through the Red Planet's atmosphere have been checked in flight."
    },
    {
        "title": "NASA Establishes Board to Initially Review Mars Sample Return Plans",
        "preview": "The board will assist with analysis of current plans and goals for one of the most difficult missions humanity has ever undertaken."
    },
    {
        "title": "NASA's Perseverance Rover Mission Getting in Shape for Launch",
        "preview": "Stacking spacecraft components on top of each other is one of the final assembly steps before a mission launches to the Red Planet. "
    },
    {
        "title": "NASA Perseverance Mars Rover Scientists Train in the Nevada Desert",
        "preview": "Team members searched for signs of ancient microscopic life there, just as NASA's latest rover will on the Red Planet next year."
    },
    {
        "title": "NASA's Mars 2020 Rover Tests Descent-Stage Separation",
        "preview": "A crane lifts the rocket-powered descent stage away from NASA's Mars 2020 rover after technicians tested the pyrotechnic charges that separate the two spacecraft."
    },
    {
        "title": "Join NASA for the Launch of the Mars 2020 Perseverance Rover",
        "preview": "No matter where you live, choose from a menu of activities to join NASA as we \"Countdown to Mars\" and launch the Perseverance rover to the Red Planet."
    },
    {
        "title": "While Stargazing on Mars, NASA's Curiosity Rover Spots Earth and Venus",
        "preview": "This new portrait of the Red Planet's neighbors was taken during a time when there's more dust in the air on Mars."
    },
    {
        "title": "NASA's Mars Perseverance Rover Gets Its Sample Handling System",
        "preview": "The system will be collecting and storing Martian rock and soil. Its installation marks another milestone in the march toward the July launch period."
    },
    {
        "title": "5 Hidden Gems Are Riding Aboard NASA's Perseverance Rover",
        "preview": "The symbols, mottos, and small objects added to the agency's newest Mars rover serve a variety of purposes, from functional to decorative."
    },
    {
        "title": "A Martian Roundtrip: NASA's Perseverance Rover Sample Tubes",
        "preview": "Marvels of engineering, the rover's sample tubes must be tough enough to safely bring Red Planet samples on the long journey back to Earth in immaculate condition. "
    },
    {
        "title": "MOXIE Could Help Future Rockets Launch Off Mars",
        "preview": "NASA's Perseverance rover carries a device to convert Martian air into oxygen that, if produced on a larger scale, could be used not just for breathing, but also for fuel."
    },
    {
        "title": "A Year of Surprising Science From NASA's InSight Mars Mission",
        "preview": "A batch of new papers summarizes the lander's findings above and below the surface of the Red Planet."
    },
    {
        "title": "Follow NASA's Perseverance Rover in Real Time on Its Way to Mars",
        "preview": "A crisply rendered web application can show you where the agency's Mars 2020 mission is right now as it makes its way to the Red Planet for a Feb. 18, 2021, landing."
    },
    {
        "title": "Mars InSight Lander to Push on Top of the 'Mole'",
        "preview": "Engineers have a plan for pushing down on the heat probe, which has been stuck at the Martian surface for a year."
    }
]